#include <iostream>

using namespace std;

int main()
{   
    cout << "Привет!" << endl;
    cout << "Этот код первый который я написал самостоятельно" << endl << endl;
    cout << "========================================================="<< endl;
    cout << 2+2*2<< endl;
    cout << "========================================================="<< endl;
    cout << 4.0/3*10*10*10*3.14<< endl;
    
    cout << "========================================================="<< endl;
    cout << "      /\\      " <<endl;
    cout << "     //\\\\      " <<endl; 
    cout << "    ///\\\\\\      " <<endl; 
    cout << "      /|\\      " <<endl; 
   

    return 0;
}